INSERT INTO public."Порода"(название_породы, производительность, средний_вес, содержание_диеты)
	VALUES 
	('волв' , 23, 12, 'гртвлы'), 
	('товл' , 12, 34, 'марыло'),
	('двдл' , 12, 98, 'йцув'),
	('бьтьм' , 23, 76, 'йцук'),
	('мпрт' , 34, 76, 'ыамс');

INSERT INTO public."директор"(фио_директора)
	VALUES
	('волв д. т.'), 
	('товл р. м.'),
	('двдл з. г.'),
	('бьтьм т. д.'),
	('ыдлст д. т.');
	
INSERT INTO public."работник"(id_работника, паспортные_данные, зарплата)
	VALUES
	(1, 85464, 87654),
	(2, 8233, 2345),
	(3, 8546, 87654),
	(4, 8233, 2345),
	(5, 871873538587, 76543);
	
INSERT INTO public."цех"(номер_цеха)
	VALUES
	(1),
	(27),
	(3),
	(4),
	(5);
	
INSERT INTO public."клетка"(id_клетки, ряд_клетки, номер_клетки, вместительность, номер_цеха_fk)
	VALUES
	(1, 1, 12, 23, 1),
	(2, 2, 34, 65, 27),
	(3, 6, 14, 28, 3),
	(4, 7, 187, 20, 4),
	(5, 9, 19, 25, 5);
	
INSERT INTO public."курица"(серийный_номер_курицы, вес, название_породы_fk, возраст, кол_во_яиц, id_клетки_fk)
	VALUES
	(1, 5, 'волв', 1, 3, 1),
	(2, 4, 'товл', 2, 3, 2),
	(3, 3, 'двдл', 3, 7, 3),
	(4, 2, 'бьтьм', 6, 5, 4), 
	(5, 1, 'мпрт', 6, 3, 5);
	
INSERT INTO public."отчет"(id_работника_fk, количество_яиц, количество_кур, с_п_породы, с_п_цеха, производительность_птицефабрики)
	VALUES
	(1, 4, 5, 3, 3, 4), 
	(2, 3, 3, 5, 4, 4),
	(3, 5, 6, 4, 3, 7),
	(4, 3, 5, 7, 3, 4),
	(5, 4, 5, 5, 4, 4);
	
	
